siteroot/app/controllers/resources_controller.rb

INSERT INTO "resources" ("created_at", "description", "page_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 14 Jul 2013 02:26:02 UTC +00:00], ["description", "ly"], ["page_id", nil], ["title", "goob"], ["updated_at", Sun, 14 Jul 2013 02:26:02 UTC +00:00]]
---
  def create
    @resource = Resource.create(params[:resource])