siteroot/app/controllers/test_controller.rb

  def uploading_files
  	@resources = Resource.all
---
SELECT "resources".* FROM "resources"

  def sample_display_page
  	@page = Page.find_by_title("Sample Page")
---
SELECT "pages".* FROM "pages" WHERE "pages"."title" = 'Sample Page' LIMIT 1