siteroot/app/controllers/test_controller.rb

  def sample_display_page
  	@page = Page.find_by_id(1)
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1