siteroot/app/views/test/sample_display_page.html.haml

SELECT "resources".* FROM "resources" WHERE "resources"."page_id" = 1
---
/ 		.main-resource-bar
/ 		- folder.resources.each do |resource|