siteroot/app/views/test/uploading_files.html.haml

SELECT "resources".* FROM "resources"
---
	= resource.title
	- if resource.resource_file.exists? then